35-auth-and-JWT/painting-example-app-backend/app/controllers/api/v1/auth_controller.rb

  def show
    token = request.headers["Authorization"]
    user = User.find_by(id: user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]